app/controllers/attendances_controller.rb

	def new
     @event = Event.find(params[:event_id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]