app/controllers/events_controller.rb

  def create

    puts "#"*60
    puts params
    puts "#"*60
  	 @event = Event.create(start_date:params[:start_date],
  	 	                     duration:params[:duration],
  	 	                     title:params[:title],
  	 	                     description:params[:description],
  	 	                     price:params[:price],
  	 	                     location:params[:location],
  	 	                     admin_id:(rand(1..20))
  	 	                   )
---
INSERT INTO "events" ("start_date", "duration", "title", "description", "price", "location", "admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"